MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG124/mcu.h
extern volatile __AD1CON1bits_t AD1CON1bits __asm__ ("AD1CON1") __attribute__((section("sfrs"), address(0xBF84B000)));
#define AD1CON2 AD1CON2
extern volatile uint32_t   AD1CON2 __attribute__((section("sfrs"), address(0xBF84B004)));
typedef struct {
  uint32_t ADCDIV:7;
  uint32_t :1;
  uint32_t ADCSEL:2;
  uint32_t :3;
  uint32_t LOWPWR:1;
  uint32_t BOOST:1;
  uint32_t :1;
  uint32_t SAMC:8;
  uint32_t :7;
  uint32_t ADCRDY:1;
} __AD1CON2bits_t;
extern volatile __AD1CON2bits_t AD1CON2bits __asm__ ("AD1CON2") __attribute__((section("sfrs"), address(0xBF84B004)));
#define AD1CON3 AD1CON3
extern volatile uint32_t   AD1CON3 __attribute__((section("sfrs"), address(0xBF84B008)));
typedef struct {
  uint32_t ADINSEL:6;
  uint32_t :4;
  uint32_t VREFSEL:3;
  uint32_t :16;
  uint32_t RQCONVRT:1;
  uint32_t GSWTRG:1;
  uint32_t CAL:1;
} __AD1CON3bits_t;
extern volatile __AD1CON3bits_t AD1CON3bits __asm__ ("AD1CON3") __attribute__((section("sfrs"), address(0xBF84B008)));
#define AD1IMOD AD1IMOD
extern volatile uint32_t   AD1IMOD __attribute__((section("sfrs"), address(0xBF84B00C)));
typedef struct {
  uint32_t SH0MOD:2;
  uint32_t SH1MOD:2;
  uint32_t SH2MOD:2;
  uint32_t SH3MOD:2;
  uint32_t SH4MOD:2;
  uint32_t SH5MOD:2;
  uint32_t :4;
  uint32_t SH0ALT:2;
  uint32_t SH1ALT:2;
  uint32_t SH2ALT:2;
  uint32_t SH3ALT:2;
  uint32_t SH4ALT:2;
} __AD1IMODbits_t;
extern volatile __AD1IMODbits_t AD1IMODbits __asm__ ("AD1IMOD") __attribute__((section("sfrs"), address(0xBF84B00C)));
#define AD1GIRQEN1 AD1GIRQEN1
extern volatile uint32_t   AD1GIRQEN1 __attribute__((section("sfrs"), address(0xBF84B010)));
typedef struct {
  uint32_t AGIEN0:1;
  uint32_t AGIEN1:1;
  uint32_t AGIEN2:1;
  uint32_t AGIEN3:1;
  uint32_t AGIEN4:1;
  uint32_t AGIEN5:1;
  uint32_t AGIEN6:1;
  uint32_t AGIEN7:1;
  uint32_t AGIEN8:1;
  uint32_t AGIEN9:1;
  uint32_t AGIEN10:1;
  uint32_t AGIEN11:1;
  uint32_t AGIEN12:1;
  uint32_t AGIEN13:1;
  uint32_t AGIEN14:1;
  uint32_t AGIEN15:1;
  uint32_t AGIEN16:1;
  uint32_t AGIEN17:1;
  uint32_t AGIEN18:1;
  uint32_t AGIEN19:1;
  uint32_t AGIEN20:1;
  uint32_t AGIEN21:1;
  uint32_t AGIEN22:1;
  uint32_t AGIEN23:1;
  uint32_t AGIEN24:1;
  uint32_t AGIEN25:1;
  uint32_t AGIEN26:1;
  uint32_t AGIEN27:1;
  uint32_t AGIEN28:1;
  uint32_t AGIEN29:1;
  uint32_t AGIEN30:1;
  uint32_t AGIEN31:1;
} __AD1GIRQEN1bits_t;
extern volatile __AD1GIRQEN1bits_t AD1GIRQEN1bits __asm__ ("AD1GIRQEN1") __attribute__((section("sfrs"), address(0xBF84B010)));
#define AD1GIRQEN2 AD1GIRQEN2
extern volatile uint32_t   AD1GIRQEN2 __attribute__((section("sfrs"), address(0xBF84B014)));
typedef struct {
  uint32_t AGIEN32:1;
  uint32_t AGIEN33:1;
  uint32_t AGIEN34:1;
  uint32_t AGIEN35:1;
  uint32_t AGIEN36:1;
  uint32_t AGIEN37:1;
  uint32_t AGIEN38:1;
  uint32_t AGIEN39:1;
  uint32_t AGIEN40:1;
  uint32_t AGIEN41:1;
  uint32_t AGIEN42:1;
  uint32_t AGIEN43:1;
  uint32_t AGIEN44:1;
} __AD1GIRQEN2bits_t;
extern volatile __AD1GIRQEN2bits_t AD1GIRQEN2bits __asm__ ("AD1GIRQEN2") __attribute__((section("sfrs"), address(0xBF84B014)));
#define AD1CSS1 AD1CSS1
extern volatile uint32_t   AD1CSS1 __attribute__((section("sfrs"), address(0xBF84B018)));
typedef struct {
  uint32_t CSS0:1;
  uint32_t CSS1:1;
  uint32_t CSS2:1;
  uint32_t CSS3:1;
  uint32_t CSS4:1;
  uint32_t CSS5:1;
  uint32_t CSS6:1;
  uint32_t CSS7:1;
  uint32_t CSS8:1;
  uint32_t CSS9:1;
  uint32_t CSS10:1;
  uint32_t CSS11:1;
  uint32_t CSS12:1;
  uint32_t CSS13:1;
  uint32_t CSS14:1;
  uint32_t CSS15:1;
  uint32_t CSS16:1;
  uint32_t CSS17:1;
  uint32_t CSS18:1;
  uint32_t CSS19:1;
  uint32_t CSS20:1;
  uint32_t CSS21:1;
  uint32_t CSS22:1;
  uint32_t CSS23:1;
  uint32_t CSS24:1;
  uint32_t CSS25:1;
  uint32_t CSS26:1;
  uint32_t CSS27:1;
  uint32_t CSS28:1;
  uint32_t CSS29:1;
  uint32_t CSS30:1;
  uint32_t CSS31:1;
} __AD1CSS1bits_t;
extern volatile __AD1CSS1bits_t AD1CSS1bits __asm__ ("AD1CSS1") __attribute__((section("sfrs"), address(0xBF84B018)));
#define AD1CSS2 AD1CSS2
extern volatile uint32_t   AD1CSS2 __attribute__((section("sfrs"), address(0xBF84B01C)));
typedef struct {
  uint32_t CSS32:1;
  uint32_t CSS33:1;
  uint32_t CSS34:1;
  uint32_t CSS35:1;
  uint32_t CSS36:1;
  uint32_t CSS37:1;
  uint32_t CSS38:1;
  uint32_t CSS39:1;
  uint32_t CSS40:1;
  uint32_t CSS41:1;
  uint32_t CSS42:1;
  uint32_t CSS43:1;
  uint32_t CSS44:1;
} __AD1CSS2bits_t;
extern volatile __AD1CSS2bits_t AD1CSS2bits __asm__ ("AD1CSS2") __attribute__((section("sfrs"), address(0xBF84B01C)));
#define AD1DSTAT1 AD1DSTAT1
extern volatile uint32_t   AD1DSTAT1 __attribute__((section("sfrs"), address(0xBF84B020)));
typedef struct {
  uint32_t ARDY0:1;
  uint32_t ARDY1:1;
  uint32_t ARDY2:1;
  uint32_t ARDY3:1;
  uint32_t ARDY4:1;
  uint32_t ARDY5:1;
  uint32_t ARDY6:1;
  uint32_t ARDY7:1;
  uint32_t ARDY8:1;
  uint32_t ARDY9:1;
  uint32_t ARDY10:1;
  uint32_t ARDY11:1;
  uint32_t ARDY12:1;
  uint32_t ARDY13:1;
  uint32_t ARDY14:1;
  uint32_t ARDY15:1;
  uint32_t ARDY16:1;
  uint32_t ARDY17:1;
  uint32_t ARDY18:1;
  uint32_t ARDY19:1;
  uint32_t ARDY20:1;
  uint32_t ARDY21:1;
  uint32_t ARDY22:1;
  uint32_t ARDY23:1;
  uint32_t ARDY24:1;
  uint32_t ARDY25:1;
  uint32_t ARDY26:1;
  uint32_t ARDY27:1;
  uint32_t ARDY28:1;
  uint32_t ARDY29:1;
  uint32_t ARDY30:1;
  uint32_t ARDY31:1;
} __AD1DSTAT1bits_t;
extern volatile __AD1DSTAT1bits_t AD1DSTAT1bits __asm__ ("AD1DSTAT1") __attribute__((section("sfrs"), address(0xBF84B020)));
#define AD1DSTAT2 AD1DSTAT2
extern volatile uint32_t   AD1DSTAT2 __attribute__((section("sfrs"), address(0xBF84B024)));
typedef struct {
  uint32_t ARDY32:1;
  uint32_t ARDY33:1;
  uint32_t ARDY34:1;
  uint32_t ARDY35:1;
  uint32_t ARDY36:1;
  uint32_t ARDY37:1;
  uint32_t ARDY38:1;
  uint32_t ARDY39:1;
  uint32_t ARDY40:1;
  uint32_t ARDY41:1;
  uint32_t ARDY42:1;
  uint32_t ARDY43:1;
  uint32_t ARDY44:1;
} __AD1DSTAT2bits_t;
extern volatile __AD1DSTAT2bits_t AD1DSTAT2bits __asm__ ("AD1DSTAT2") __attribute__((section("sfrs"), address(0xBF84B024)));
#define AD1CMPEN1 AD1CMPEN1
extern volatile uint32_t   AD1CMPEN1 __attribute__((section("sfrs"), address(0xBF84B028)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __AD1CMPEN1bits_t;
extern volatile __AD1CMPEN1bits_t AD1CMPEN1bits __asm__ ("AD1CMPEN1") __attribute__((section("sfrs"), address(0xBF84B028)));
#define AD1CMP1 AD1CMP1
extern volatile uint32_t   AD1CMP1 __attribute__((section("sfrs"), address(0xBF84B02C)));
typedef struct {
  uint32_t ADCMPLO:16;
  uint32_t ADCMPHI:16;
} __AD1CMP1bits_t;
extern volatile __AD1CMP1bits_t AD1CMP1bits __asm__ ("AD1CMP1") __attribute__((section("sfrs"), address(0xBF84B02C)));
#define AD1CMPEN2 AD1CMPEN2
extern volatile uint32_t   AD1CMPEN2 __attribute__((section("sfrs"), address(0xBF84B030)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __AD1CMPEN2bits_t;
