MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG124/mcu.h
#define _PORTH_RH4_POSITION                      0x00000004
#define _PORTH_RH4_MASK                          0x00000010
#define _PORTH_RH4_LENGTH                        0x00000001

#define _PORTH_RH5_POSITION                      0x00000005
#define _PORTH_RH5_MASK                          0x00000020
#define _PORTH_RH5_LENGTH                        0x00000001

#define _PORTH_RH6_POSITION                      0x00000006
#define _PORTH_RH6_MASK                          0x00000040
#define _PORTH_RH6_LENGTH                        0x00000001

#define _PORTH_RH8_POSITION                      0x00000008
#define _PORTH_RH8_MASK                          0x00000100
#define _PORTH_RH8_LENGTH                        0x00000001

#define _PORTH_RH9_POSITION                      0x00000009
#define _PORTH_RH9_MASK                          0x00000200
#define _PORTH_RH9_LENGTH                        0x00000001

#define _PORTH_RH10_POSITION                     0x0000000A
#define _PORTH_RH10_MASK                         0x00000400
#define _PORTH_RH10_LENGTH                       0x00000001

#define _PORTH_RH12_POSITION                     0x0000000C
#define _PORTH_RH12_MASK                         0x00001000
#define _PORTH_RH12_LENGTH                       0x00000001

#define _PORTH_RH13_POSITION                     0x0000000D
#define _PORTH_RH13_MASK                         0x00002000
#define _PORTH_RH13_LENGTH                       0x00000001

#define _PORTH_w_POSITION                        0x00000000
#define _PORTH_w_MASK                            0xFFFFFFFF
#define _PORTH_w_LENGTH                          0x00000020

#define _LATH_LATH0_POSITION                     0x00000000
#define _LATH_LATH0_MASK                         0x00000001
#define _LATH_LATH0_LENGTH                       0x00000001

#define _LATH_LATH1_POSITION                     0x00000001
#define _LATH_LATH1_MASK                         0x00000002
#define _LATH_LATH1_LENGTH                       0x00000001

#define _LATH_LATH4_POSITION                     0x00000004
#define _LATH_LATH4_MASK                         0x00000010
#define _LATH_LATH4_LENGTH                       0x00000001

#define _LATH_LATH5_POSITION                     0x00000005
#define _LATH_LATH5_MASK                         0x00000020
#define _LATH_LATH5_LENGTH                       0x00000001

#define _LATH_LATH6_POSITION                     0x00000006
#define _LATH_LATH6_MASK                         0x00000040
#define _LATH_LATH6_LENGTH                       0x00000001

#define _LATH_LATH8_POSITION                     0x00000008
#define _LATH_LATH8_MASK                         0x00000100
#define _LATH_LATH8_LENGTH                       0x00000001

#define _LATH_LATH9_POSITION                     0x00000009
#define _LATH_LATH9_MASK                         0x00000200
#define _LATH_LATH9_LENGTH                       0x00000001

#define _LATH_LATH10_POSITION                    0x0000000A
#define _LATH_LATH10_MASK                        0x00000400
#define _LATH_LATH10_LENGTH                      0x00000001

#define _LATH_LATH12_POSITION                    0x0000000C
#define _LATH_LATH12_MASK                        0x00001000
#define _LATH_LATH12_LENGTH                      0x00000001

#define _LATH_LATH13_POSITION                    0x0000000D
#define _LATH_LATH13_MASK                        0x00002000
#define _LATH_LATH13_LENGTH                      0x00000001

#define _LATH_w_POSITION                         0x00000000
#define _LATH_w_MASK                             0xFFFFFFFF
#define _LATH_w_LENGTH                           0x00000020

#define _ODCH_ODCH0_POSITION                     0x00000000
#define _ODCH_ODCH0_MASK                         0x00000001
#define _ODCH_ODCH0_LENGTH                       0x00000001

#define _ODCH_ODCH1_POSITION                     0x00000001
#define _ODCH_ODCH1_MASK                         0x00000002
#define _ODCH_ODCH1_LENGTH                       0x00000001

#define _ODCH_ODCH4_POSITION                     0x00000004
#define _ODCH_ODCH4_MASK                         0x00000010
#define _ODCH_ODCH4_LENGTH                       0x00000001

#define _ODCH_ODCH5_POSITION                     0x00000005
#define _ODCH_ODCH5_MASK                         0x00000020
#define _ODCH_ODCH5_LENGTH                       0x00000001

#define _ODCH_ODCH6_POSITION                     0x00000006
#define _ODCH_ODCH6_MASK                         0x00000040
#define _ODCH_ODCH6_LENGTH                       0x00000001

#define _ODCH_ODCH8_POSITION                     0x00000008
#define _ODCH_ODCH8_MASK                         0x00000100
#define _ODCH_ODCH8_LENGTH                       0x00000001

#define _ODCH_ODCH9_POSITION                     0x00000009
#define _ODCH_ODCH9_MASK                         0x00000200
#define _ODCH_ODCH9_LENGTH                       0x00000001

#define _ODCH_ODCH10_POSITION                    0x0000000A
#define _ODCH_ODCH10_MASK                        0x00000400
#define _ODCH_ODCH10_LENGTH                      0x00000001

#define _ODCH_ODCH12_POSITION                    0x0000000C
#define _ODCH_ODCH12_MASK                        0x00001000
#define _ODCH_ODCH12_LENGTH                      0x00000001

#define _ODCH_ODCH13_POSITION                    0x0000000D
#define _ODCH_ODCH13_MASK                        0x00002000
#define _ODCH_ODCH13_LENGTH                      0x00000001

#define _ODCH_w_POSITION                         0x00000000
#define _ODCH_w_MASK                             0xFFFFFFFF
#define _ODCH_w_LENGTH                           0x00000020

#define _CNPUH_CNPUH0_POSITION                   0x00000000
#define _CNPUH_CNPUH0_MASK                       0x00000001
#define _CNPUH_CNPUH0_LENGTH                     0x00000001

#define _CNPUH_CNPUH1_POSITION                   0x00000001
#define _CNPUH_CNPUH1_MASK                       0x00000002
#define _CNPUH_CNPUH1_LENGTH                     0x00000001

#define _CNPUH_CNPUH4_POSITION                   0x00000004
#define _CNPUH_CNPUH4_MASK                       0x00000010
#define _CNPUH_CNPUH4_LENGTH                     0x00000001

